# **Practice DS101**

## Section 01 - Python fundamentals

In [11]:
numbers = [12, 45, 67, 23, 89, 10, 34, 57]

mean = sum(numbers) / len(numbers)
max_n = max(numbers)
min_n = min(numbers)
length_n = len(numbers)

students = {
    "Ayesha": 88,
    "Kamal": 72,
    "Ravi": 95
    
}

for i in students.values():
    if i > 75:
        print(i)

def square(x):
    return x * x

88
95

## Section 02 - Numpy Essesntials

In [12]:
import numpy as np
arr = np.array(numbers)

In [13]:
arr

array([12, 45, 67, 23, 89, 10, 34, 57])

In [14]:
np.mean(arr)

42.125

In [15]:
np.std(arr)

26.021325388995848

In [16]:
np.var(arr)

677.109375

In [18]:
print(arr * 3)

[ 36 135 201  69 267  30 102 171]

In [23]:
condition = arr > 40
print(arr[condition])

[45 67 89 57]

## Section 03 - Pandas

In [26]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Ayesha", "Kamal", "Ravi", "Nimal", "Saman", "Rashmi"],
    "Age": [23, 31, 21, 29, 35, 27],
    "Department": ["Sales", "HR", "Sales", "IT", "IT", "HR"],
    "Salary": [50000, 62000, 48000, 75000, 80000, 59000],
    "Experience": [1.2, 4.5, 0.8, 6.0, 7.2, 3.0],
    "Remote": ["Yes", "No", "Yes", "No", "No", "Yes"]
})

### Data Understanding

In [29]:
df.head(3)

     Name  Age Department  Salary  Experience Remote
0  Ayesha   23      Sales   50000         1.2    Yes
1   Kamal   31         HR   62000         4.5     No
2    Ravi   21      Sales   48000         0.8    Yes

In [30]:
df.describe()

             Age        Salary  Experience
count   6.000000      6.000000    6.000000
mean   27.666667  62333.333333    3.783333
std     5.163978  12971.764208    2.580245
min    21.000000  48000.000000    0.800000
25%    24.000000  52250.000000    1.650000
50%    28.000000  60500.000000    3.750000
75%    30.500000  71750.000000    5.625000
max    35.000000  80000.000000    7.200000

In [31]:
df.dtypes

Name           object
Age             int64
Department     object
Salary          int64
Experience    float64
Remote         object
dtype: object

In [32]:
df.isna().sum()

Name          0
Age           0
Department    0
Salary        0
Experience    0
Remote        0
dtype: int64

In [34]:
df['Department'].unique()

array(['Sales', 'HR', 'IT'], dtype=object)

### Selecting and filtering

In [37]:
df[['Name', 'Salary']]

     Name  Salary
0  Ayesha   50000
1   Kamal   62000
2    Ravi   48000
3   Nimal   75000
4   Saman   80000
5  Rashmi   59000

In [39]:
df[df['Age']> 25][['Name','Remote']]

     Name Remote
1   Kamal     No
3   Nimal     No
4   Saman     No
5  Rashmi    Yes

In [41]:
df[df['Department'] == "HR"]

     Name  Age Department  Salary  Experience Remote
1   Kamal   31         HR   62000         4.5     No
5  Rashmi   27         HR   59000         3.0    Yes

In [54]:
df[(df["Salary"] > 30000) & (df["Salary"]<75000)]

     Name  Age Department  Salary  Experience Remote
0  Ayesha   23      Sales   50000         1.2    Yes
1   Kamal   31         HR   62000         4.5     No
2    Ravi   21      Sales   48000         0.8    Yes
5  Rashmi   27         HR   59000         3.0    Yes

In [55]:
df[df['Remote'] == "No"]

    Name  Age Department  Salary  Experience Remote
1  Kamal   31         HR   62000         4.5     No
3  Nimal   29         IT   75000         6.0     No
4  Saman   35         IT   80000         7.2     No

### Cleaning

In [56]:
df_no_duplicates = df.drop_duplicates()
df_no_duplicates

     Name  Age Department  Salary  Experience Remote
0  Ayesha   23      Sales   50000         1.2    Yes
1   Kamal   31         HR   62000         4.5     No
2    Ravi   21      Sales   48000         0.8    Yes
3   Nimal   29         IT   75000         6.0     No
4   Saman   35         IT   80000         7.2     No
5  Rashmi   27         HR   59000         3.0    Yes

In [76]:
df_label_replaced = df.copy()
df_label_replaced.head()
df_label_replaced['Remote'].replace({"Yes" : 1, "No" : 0},inplace=True)
df_label_replaced

C:\Users\User\AppData\Local\Temp\ipykernel_23052\2470438285.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_label_replaced['Remote'].replace({"Yes" : 1, "No" : 0},inplace=True)

     Name  Age Department  Salary  Experience  Remote
0  Ayesha   23      Sales   50000         1.2       1
1   Kamal   31         HR   62000         4.5       0
2    Ravi   21      Sales   48000         0.8       1
3   Nimal   29         IT   75000         6.0       0
4   Saman   35         IT   80000         7.2       0
5  Rashmi   27         HR   59000         3.0       1

In [78]:
df['Age'].astype(float)

0    23.0
1    31.0
2    21.0
3    29.0
4    35.0
5    27.0
Name: Age, dtype: float64

In [79]:
df_filled = df.copy()
df_filled['Experience'].fillna(df['Experience'].mean())

0    1.2
1    4.5
2    0.8
3    6.0
4    7.2
5    3.0
Name: Experience, dtype: float64

### Groupby and Aggregation